// 1. По кліку на кнопку відбувається гет запит на отримання властивості рев"ю поточного користувача
// 2. Якщо такої немає, то передається пропс фолс / Якщо є, то передається значення цієї властивості.
// 3. Відкривається модалка, із змістом відповідно до отриманого пропса.
// 4.  Якщо фолс:
//                 - то текстове поле пусте з плейсхолдером, відображаються нижні кнопки.
//                 - є можливість писати відгук, якщо поле не пусте, стає активна кнопка сейв.
//                 - після натискання сейв - відбувається апдейт запит на створення нової властивості поточного користувача
//                 - якщо апдейт успішний - модалка закривається, з"являється повідомлення про успішно доданий відгук.
//                 - якщо помилка, модалка не закривається і з"являється повідомлення про помилку. Є можливість ще раз спробувати надіслати.
// 5. Якщо тру:
//                 - значення властивості додається у стан та з"являється модалка з текстом, який можна лише читати та відображаються верхні кнопки.
//                 - при натисканні на редагування, текст стає доступний для редагування та з"являються нижні кнопки.
//                 - оновлюється стан рейтингу.
//                 - при натисканні на видалення - надсилається апгрейд запит на оновлення користувача без властивості "відгук" та закривається модалка.
//                 - при натисканні на оновити - надсилається апгрейд запит на оновлення властивості "відгук".

export const Feedback = props => {
  const onModal = () => {};

  return <button type="submit" onClick={onModal}></button>;
};
